import streamlit as st 
import pandas as pd
from historycal_analiz import historycal_data_analizer

def run_analystic():
    st.set_page_config(
        page_title='Анализ исторических температурных данных',
        page_icon='📊',
        layout='wide'
    )
    st.markdown('📊 Анализ исторических температурных данных')

    #боковая паленька
    with st.sidebar:
        st.header('Настройки анализа')
        uploaded_file = st.file_uploader('Выберите csv файл ',type = ['csv'],help="Поддерживаемые форматы: CSV") ###потому можно расширить до json or exel
        if uploaded_file:
            st.success('Файл успешно подгружен')

            #превью потом можно убрать
            with st.expander('предварительный просмотр'):
                try:
                    df_preview = pd.read_csv(uploaded_file)
                    st.dataframe(df_preview.head())
                    st.write(f'Размер данных - {df_preview.shape[0]} строк и {df_preview.shape[1]} колонок')
                except Exception as e:
                    st.error(f'Ошибка при чтении файла {str(e)}')

        #####настройка анализа
        st.divider()
        st.subheader('Параметры анализа')

        window_size = st.slider(
            "Размер окна для скользящего среднего:",
            min_value=7,
            max_value=90,
            value=30,
            help="Количество дней для расчета скользящего среднего"
        )
        anomaly_threshold = st.slider(
            "Порог обнаружения аномалий:",
            min_value=1.0,
            max_value=3.0,
            value=2.0,
            step=0.5,
            help="Количество стандартных отклонений для определения аномалии"
        )
        st.divider()

        st.subheader(" Метод анализа")
        analysts_method = st.radio(
            "Выберите метод выполнения анализа:",
            ["Синхронный", "Параллельный (Joblib)", "Многопоточный", 
             "Многопроцессный", "Асинхронный", "Запустить бенчмарк всех методов"],
            index=0,
            help="""Сравнение различных подходов к обработке данных:
            • Синхронный: последовательная обработка
            • Параллельный: использование всех ядер CPU
            • Многопоточный: для I/O операций
            • Многопроцессный: для CPU-intensive задач
            • Асинхронный: для демонстрации подхода"""
        )
        if analysts_method  == "Запустить бенчмарк всех методов":
            st.warning("⚠️ Бенчмарк может занять некоторое время")

        ###наконец создание датафрейма
        if uploaded_file is not None:
            try:
                df = pd.read_csv(uploaded_file)

                ##проверка нужных колонок
                required_columns = ['city', 'timestamp', 'temperature', 'season']
                missing_columns = [col for col in required_columns if col not in df.columns]
                if missing_columns:
                    st.error(f"Отсутствуют необходимые колонки: {', '.join(missing_columns)}")
                    return
                 # Инициализация анализатора
                analyzer =  historycal_data_analizer(df)

                #выбор
                cities = df['city'].unique()
                select_city = st.selectbox('Выберите город для детального анализа:',cities)
            except Exception as e:
                st.error(f'Ошибка при анализе {str(e)}')



        



# uploaded_file = st.file_uploader('Выберите csv файл ',type = ['csv'])

# if uploaded_file is not None:
#     data = pd.read_csv(uploaded_file)
#     st.write('превью')
#     st.dataframe(data)
# else:
#     st.write('выберите файл')

    